app/controllers/student_controller.rb

  def show
    @student = Student.all.find(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]